clear;clc;
%%运行的主函数
%样本数据
X = [2;3;4;5;6;7;8;9;10;11];
Y = [58;50;44;38;34;30;29;26;25;24];
syms x;
%% (1)2次最佳平方逼近
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m = [m0'*m0 m0'*m1 m0'*m2; m1'*m0 m1'*m1 m1'*m2; m2'*m0 m2'*m1 m2'*m2];
c = m\[Y'*m0; Y'*m1; Y'*m2];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
y(x) = c0+c1*x+c2*x.^2;
%拟合误差Q2
Q2 = 0;
for i=1:1:10
    Q2 = Q2+double((y(X(i,1))-Y(i,1))^2);
end
Q2
%% (1)3次最佳平方逼近
syms x;
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m3 = m2.*m1;
m = [m0'*m0 m0'*m1 m0'*m2 m0'*m3; m1'*m0 m1'*m1 m1'*m2 m1'*m3; m2'*m0 m2'*m1 m2'*m2 m2'*m3; m3'*m0 m3'*m1 m3'*m2 m3'*m3];
c = m\[Y'*m0; Y'*m1; Y'*m2; Y'*m3];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
c3 = c(4,1);
y(x) = c0+c1*x+c2*x.^2+c3*x.^3;
%拟合误差Q3
Q3 = 0;
for i=1:1:10
    Q3 = Q3+double((y(X(i,1))-Y(i,1))^2);
end
Q3

%% (1)4次最佳平方逼近
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m3 = m2.*m1;
m4 = m3.*m1;
m = [m0'*m0 m0'*m1 m0'*m2 m0'*m3 m0'*m4;
    m1'*m0 m1'*m1 m1'*m2 m1'*m3 m1'*m4;
    m2'*m0 m2'*m1 m2'*m2 m2'*m3 m2'*m4;
    m3'*m0 m3'*m1 m3'*m2 m3'*m3 m3'*m4
    m4'*m0 m4'*m1 m4'*m2 m4'*m3 m4'*m4];
c = m\[Y'*m0; Y'*m1; Y'*m2; Y'*m3; Y'*m4];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
c3 = c(4,1);
c4 = c(5,1);
y(x) = c0+c1*x+c2*x.^2+c3*x.^3+c4*x.^4;
%拟合误差Q4
Q4 = 0;
for i=1:1:10
    Q4 = Q4+double((y(X(i,1))-Y(i,1))^2);
end
Q4

%% (2)a+b/x
syms t
T = X.^(-1);
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = T;
m = [m0'*m0 m0'*m1; m1'*m0 m1'*m1];
c = m\[Y'*m0; Y'*m1];
a = c(1,1);
b = c(2,1);
y(t) = a+b*t;
%拟合误差T1
T1 = 0;
for i=1:1:10
    T1 = T1+double((y(T(i,1))-Y(i,1))^2);
end
T1
%% (2)a+blnx
T = log(X);
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = T;
m = [m0'*m0 m0'*m1; m1'*m0 m1'*m1];
c = m\[Y'*m0; Y'*m1];
a = c(1,1);
b = c(2,1);
y(t) = a+b*t;
%拟合误差T2
T2 = 0;
for i=1:1:10
    T2 = T2+double((y(T(i,1))-Y(i,1))^2);
end
T2
%% (2)a*e^(bx)
Z = log(Y);
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m = [m0'*m0 m0'*m1; m1'*m0 m1'*m1];
c = m\[Z'*m0; Z'*m1];
c0 = c(1,1);
c1 = c(2,1);
a = exp(c0);
b = c1;
y(t) = a*exp(b*t);
%拟合误差T3
T3 = 0;
for i=1:1:10
    T3 = T3+double((y(X(i,1))-Y(i,1))^2);
end
T3
%% (2)1/(a+bx)
Z = Y.^(-1);
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m = [m0'*m0 m0'*m1; m1'*m0 m1'*m1];
c = m\[Z'*m0; Z'*m1];
c0 = c(1,1);
c1 = c(2,1);
a = c0;
b = c1;
y(t) = 1/(a+b*t);
%拟合误差T4
T4 = 0;
for i=1:1:10
    T4 = T4+double((y(X(i,1))-Y(i,1))^2);
end
T4