clear;clc;
%%运行的主函数
%样本数据
X = [2;3;4;5;6;7;8;9;10;11];
Y = [58;50;44;38;34;30;29;26;25;24];
syms x;
%% (1)4次最佳平方逼近
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m3 = m2.*m1;
m4 = m3.*m1;
m = [m0'*m0 m0'*m1 m0'*m2 m0'*m3 m0'*m4;
    m1'*m0 m1'*m1 m1'*m2 m1'*m3 m1'*m4;
    m2'*m0 m2'*m1 m2'*m2 m2'*m3 m2'*m4;
    m3'*m0 m3'*m1 m3'*m2 m3'*m3 m3'*m4
    m4'*m0 m4'*m1 m4'*m2 m4'*m3 m4'*m4];
c = m\[Y'*m0; Y'*m1; Y'*m2; Y'*m3; Y'*m4];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
c3 = c(4,1);
c4 = c(5,1);
y(x) = c0+c1*x+c2*x.^2+c3*x.^3+c4*x.^4;
%拟合误差Q4
Q4 = 0;
for i=1:1:10
    Q4 = Q4+double((y(X(i,1))-Y(i,1))^2);
end
Q4
x=2:0.1:11;
plot(x,y(x),'r');%用红色曲线画图
title(['4次最佳平方逼近 拟合误差：',num2str(Q4)]);
grid;%画网格