clear;clc;
%%运行的主函数
%样本数据
X = [2;3;4;5;6;7;8;9;10;11];
Y = [58;50;44;38;34;30;29;26;25;24];
syms x;
%% (1)2次最佳平方逼近
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m = [m0'*m0 m0'*m1 m0'*m2; m1'*m0 m1'*m1 m1'*m2; m2'*m0 m2'*m1 m2'*m2];
c = m\[Y'*m0; Y'*m1; Y'*m2];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
y(x) = c0+c1*x+c2*x.^2;
%拟合误差Q2
Q2 = 0;
for i=1:1:10
    Q2 = Q2+double((y(X(i,1))-Y(i,1))^2);
end
Q2
subplot(2,1,1);% x表示共有几行，y表示有几列，n第几幅图片
x=2:0.1:11;
plot(x,y(x),'r');%用红色曲线画图
title(['2次最佳平方逼近 拟合误差：',num2str(Q2)]);
grid;%画网格
%% (1)3次最佳平方逼近
syms x;
m0 = [1;1;1;1;1;1;1;1;1;1];%定义基底
m1 = X;
m2 = m1.*m1;
m3 = m2.*m1;
m = [m0'*m0 m0'*m1 m0'*m2 m0'*m3; m1'*m0 m1'*m1 m1'*m2 m1'*m3; m2'*m0 m2'*m1 m2'*m2 m2'*m3; m3'*m0 m3'*m1 m3'*m2 m3'*m3];
c = m\[Y'*m0; Y'*m1; Y'*m2; Y'*m3];
c0 = c(1,1);
c1 = c(2,1);
c2 = c(3,1);
c3 = c(4,1);
y(x) = c0+c1*x+c2*x.^2+c3*x.^3;
%拟合误差Q3
Q3 = 0;
for i=1:1:10
    Q3 = Q3+double((y(X(i,1))-Y(i,1))^2);
end
Q3
subplot(2,1,2);% x表示共有几行，y表示有几列，n第几幅图片
x=2:0.1:11;
plot(x,y(x),'r');%用红色曲线画图
title(['3次最佳平方逼近 拟合误差：',num2str(Q3)]);
grid;%画网格